const films = [
	{
		id: 1, name: "Inception", img: "img/inception.webp", producer: "Christopher Nolan", year: "2010", rating: "8.7", description: "Це фантастичний трилер, який розповідає про Дома Кобба, вправного злодія, що спеціалізується на викраденні цінних секретів з підсвідомості людей уві сні. Кобба наймають для виконання ще складнішого завдання: підкинути комусь ідею у свідомість, процес, відомий як \"інкубація\". Під час виконання небезпечної місії команда стикається з низкою несподіваних перешкод і загроз.", src: "https://ashdi.vip/vod/1219", link: "https://ashdi.vip/video02/1/films/pochatok_1219/hls/AamXiHaGjuddmxH5Bw==/index.m3u8"
	},
	{
		id: 2, name: "Tenet", img: "img/tenet.webp", producer: "Christopher Nolan", year: "2020", rating: "7.5", description: "Тенет розповідає про головного героя (Джон Девід Вашингтон), оперативника ЦРУ, якого завербувала таємнича організація під назвою \"Тенет\", щоб запобігти початку Третьої світової війни. За допомогою свого напарника Ніла (Роберт Паттінсон) він повинен оволодіти мистецтвом інверсії часу - технологією, яка дозволяє предметам і людям переміщатися в минуле. Подорожуючи світом, щоб виконати свою місію, він стикається з небезпечним російським олігархом Сатором (Кеннет Брана) та його дружиною Кет (Елізабет Дебіцкі), яка володіє ключем до зупинки плану Сатора. Головний герой змагається з часом, він повинен орієнтуватися у світі, де майбутнє і минуле нерозривно пов'язані, і де доля світу висить на волосині.", src: "https://ashdi.vip/vod/40073", link: "https://ashdi.vip/video02/1/new3/tenet_2020_webrip_1080p_ukr.eng_hurtom_40073/hls/AamXiHaGjuddmxH5Bw==/index.m3u8"
	},
	{
		id: 3, name: "Interstellar", img: "img/interstellar.jpg", producer: "Christopher Nolan", year: "2014", rating: "8.5", description: "У цій епічній космічній пригоді команда астронавтів подорожує крізь червоточину в пошуках нового дому для людства. По дорозі вони стикаються з низкою викликів, зокрема з уповільненням часу та суворими реаліями космічних подорожей. Фільм досліджує теми любові, жертовності та пошуку сенсу у величезному і невблаганному всесвіті.", src: "https://ashdi.vip/vod/3205", link: "https://ashdi.vip/video02/2/films/interstellar_2014_bdrip_1080p_ukr_eng_hurtom_3205/hls/AamXiHaGjuddmxH5Bw==/index.m3u8"
	},
	{
		id: 4, name: "Transcendence", img: "img/transcendence.jpg", producer: "Christopher Nolan", year: "2014", rating: "6.3", description: "\"Перевага\" - науково-фантастичний трилер, дія якого розгортається в недалекому майбутньому. Доктор Вілл Кастер, геніальний вчений, який займається створенням штучного інтелекту, стоїть на порозі революційного відкриття, що може змінити світ. Однак його радикальні ідеї та суперечливі експерименти привертають увагу жорстокої антитехнологічної екстремістської групи. Коли він зазнає важких поранень під час замаху, дружина Кастера, Евелін, та його найкращий друг Макс вирішують завантажити його свідомість у суперкомп'ютер, сподіваючись зберегти його інтелект та особистість. Коли оцифрований Кастер отримує величезну владу і знання, він починає розширювати свій вплив за межі цифрової сфери, ставлячи під загрозу контроль людства над технологіями. Коли межі між людиною і машиною стираються, Евелін і Макс повинні вирішити, чи підтримати, чи зупинити трансцендентну еволюцію Кастера, перш ніж вона стане незворотною. Поєднуючи захопливий екшн із філософськими питаннями про природу існування та межі людського інтелекту, \"Перевага\" досліджує наслідки гри в бога з технологіями та запитує, чи справді людство готове зіткнутися з наслідками власних творінь.", src: "https://ashdi.vip/vod/13803", link: "https://ashdi.vip/video02/1/new3/transcendence_2014_bdrip_1080p_ukr_eng_hurtom_13803/hls/AamXiHaGjuddmxH5Bw==/index.m3u8"
	},
	{
		id: 5, name: "The Dark Knight Rises", img: "img/the-dark-knight-rises.webp", producer: "Christopher Nolan", year: "2012", rating: "8.3", description: "Захоплюючий фільм «Темний лицар: Відродження легенди» розкриває перед глядачем дивовижні таємниці Готема. Сім років тому безстрашний герой в масці - Бетмен, бере на себе відповідальність за всі злочини, вчинені окружним прокурором Харві Дентом. Так герой рятує репутацію прокурора і всього поліцейського департаменту. Прийнявши народний гнів на себе, Чорний Лицар йде. Але лиходії не приймають відставку Бетмена. Чорний лицар повинен повернутися. Місто знову зіткнулося із загрозою, яка вище людського розуміння - з лиходієм на ім'я Бейн. Це не дурний і потужний супротивник, який збирається знищити Готем і всіх його мешканців. Поліція виявляється безсилою, а таємнича красуня Селіна Кайл твердить про бурю, що насувається. Безстрашний Чорний Лицар повертається в останній раз. Тільки в його силах врятувати невинних людей, але яка ціна його успіху? Що дорожче, власне життя або порятунок мільйонів невдячних людей, які сім років тому прокляли і відмовилися від свого героя?", src: "https://ashdi.vip/vod/323", link: "https://ashdi.vip/video02/1/films/temnij_liczar_povertatsya_323/hls/AamXiHaGjuddmxH5Bw==/index.m3u8"
	}
];

const findAll = () => {
	return films;
};

const findbyId = (id) => {
	const result = films.find(film => film.id === id);
	return result;
};

export { findAll, findbyId }
